RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_adc.c
        /* configure ADC inserted sequence */
        if(rankx < ADC_INSERTED_CHANNEL_RANK_ONE) {
            /* the inserted sequence rank is smaller than one */
            isq = ADC_ISQ2(adc_periph);
            isq &= ~((uint32_t)((ADC_ISQX_ISMPN | ADC_ISQX_ISQN) << (ADC_INSERTED_CHANNEL_SHIFT_LENGTH * rankx)));
            isq |= ((uint32_t)(SQX_SMP(sample_time) | adc_channel) << (ADC_INSERTED_CHANNEL_SHIFT_LENGTH * rankx));
            ADC_ISQ2(adc_periph) = isq;
        } else if(rankx < ADC_INSERTED_CHANNEL_RANK_THREE) {
            /* the inserted sequence rank is smaller than three */
            isq = ADC_ISQ1(adc_periph);
            isq &= ~((uint32_t)((ADC_ISQX_ISMPN | ADC_ISQX_ISQN) << (ADC_INSERTED_CHANNEL_SHIFT_LENGTH *
                                                                     (rankx - ADC_INSERTED_CHANNEL_RANK_ONE))));
            isq |= ((uint32_t)(SQX_SMP(sample_time) | adc_channel) << (ADC_INSERTED_CHANNEL_SHIFT_LENGTH *
                                                                       (rankx - ADC_INSERTED_CHANNEL_RANK_ONE)));
            ADC_ISQ1(adc_periph) = isq;
        } else if(rankx < ADC_INSERTED_CHANNEL_RANK_FOUR) {
            /* the inserted sequence rank is smaller than four */
            isq = ADC_ISQ0(adc_periph);
            isq &= ~((uint32_t)((ADC_ISQX_ISMPN | ADC_ISQX_ISQN) << (ADC_INSERTED_CHANNEL_SHIFT_LENGTH *
                                                                     (rankx - ADC_INSERTED_CHANNEL_RANK_THREE))));
            isq |= ((uint32_t)(SQX_SMP(sample_time) | adc_channel) << (ADC_INSERTED_CHANNEL_SHIFT_LENGTH *
                                                                       (rankx - ADC_INSERTED_CHANNEL_RANK_THREE)));
            ADC_ISQ0(adc_periph) = isq;
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      configure ADC inserted channel offset
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  inserted_channel : insert channel select
                only one parameter can be selected which is shown as below:
      \arg        ADC_INSERTED_CHANNEL_0: inserted channel0
      \arg        ADC_INSERTED_CHANNEL_1: inserted channel1
      \arg        ADC_INSERTED_CHANNEL_2: inserted channel2
      \arg        ADC_INSERTED_CHANNEL_3: inserted channel3
    \param[in]  offset : the offset data
    \param[out] none
    \retval     none
*/
void adc_inserted_channel_offset_config(uint32_t adc_periph, uint8_t inserted_channel, uint32_t offset)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_PERIPH(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0016U), ERR_PERIPH);
    } else if(NOT_INSERTED_CHANNEL(inserted_channel)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0017U), ERR_PARAM_INVALID);
    } else if(NOT_ADC_INSERTED_OFFSET_VALUE(offset)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0017U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint8_t inserted_length;
        uint32_t num = 0U;

        inserted_length = (uint8_t)GET_BITS(ADC_ISQ0(adc_periph), 20U, 21U);
        num = ((uint32_t)ADC_OFFSET_LENGTH - ((uint32_t)inserted_length - (uint32_t)inserted_channel));

        if(num <= ADC_OFFSET_LENGTH) {
            /* calculate the offset of the register */
            num = num * ADC_OFFSET_SHIFT_LENGTH;
            /* config the offset of the selected channels */
            REG32((adc_periph) + ADC_IOFF0_OFFSET + num) = IOFFX_IOFF((uint32_t)offset);
        }
    }
}

/*!
    \brief      configure differential mode for ADC channel
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  adc_channel: the channel use differential mode
                one or more parameters can be selected which is shown as below:
      \arg        ADC_DIFFERENTIAL_MODE_CHANNEL_x(x=0..21), ADC_DIFFERENTIAL_MODE_CHANNEL_ALL: ADC channel for differential mode
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void adc_channel_differential_mode_config(uint32_t adc_periph, uint32_t adc_channel, ControlStatus newvalue)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_PERIPH(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0017U), ERR_PERIPH);
    } else if(NOT_ADC_DIFFERENTIAL_MODE_CHANNEL(adc_channel)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0017U), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_ADC_ENABLE_DISABLE(newvalue)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0017U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ENABLE == newvalue) {
            ADC_DIFCTL(adc_periph) |= (uint32_t)adc_channel;
        } else {
            ADC_DIFCTL(adc_periph) &= ~((uint32_t)adc_channel);
        }
    }
}

/*!
    \brief      enable ADC external trigger
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_CHANNEL: routine sequence
      \arg        ADC_INSERTED_CHANNEL: inserted sequence
    \param[in]  trigger_mode: external trigger mode
                only one parameter can be selected which is shown as below:
      \arg        EXTERNAL_TRIGGER_DISABLE: external trigger disable
      \arg        EXTERNAL_TRIGGER_RISING: rising edge of external trigger
      \arg        EXTERNAL_TRIGGER_FALLING: falling edge of external trigger
      \arg        EXTERNAL_TRIGGER_RISING_FALLING: rising and falling edge of external trigger
    \param[out] none
    \retval     none
*/
void adc_external_trigger_config(uint32_t adc_periph, uint8_t adc_sequence, uint32_t trigger_mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_PERIPH(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0018U), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0018U), ERR_PARAM_INVALID);
    } else if(NOT_ADC_TRIGGER_MODE(trigger_mode)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0018U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(adc_sequence) {
            case ADC_ROUTINE_CHANNEL:
                /* configure ADC routine sequence external trigger mode */
                ADC_CTL1(adc_periph) &= ~((uint32_t)ADC_CTL1_ETMRC);
                ADC_CTL1(adc_periph) |= (uint32_t)(trigger_mode << ROUTINE_TRIGGER_MODE);
                break;
            case ADC_INSERTED_CHANNEL:
                /* configure ADC inserted sequence external trigger mode */
                ADC_CTL1(adc_periph) &= ~((uint32_t)ADC_CTL1_ETMIC);
                ADC_CTL1(adc_periph) |= (uint32_t)(trigger_mode << INSERTED_TRIGGER_MODE);
                break;
            default:
                break;
        }
    }
}

/*!
    \brief      enable ADC software trigger
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  adc_sequence: select the sequence
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_CHANNEL: routine sequence
      \arg        ADC_INSERTED_CHANNEL: inserted sequence
    \param[out] none
    \retval     none
*/
void adc_software_trigger_enable(uint32_t adc_periph, uint8_t adc_sequence)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_PERIPH(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0019U), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENCE(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0019U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* enable routine channel software trigger */
        if(RESET != (adc_sequence & ADC_ROUTINE_CHANNEL)) {
            ADC_CTL1(adc_periph) |= (uint32_t)ADC_CTL1_SWRCST;
        }
        /* enable inserted sequence software trigger */
        if(RESET != (adc_sequence & ADC_INSERTED_CHANNEL)) {
            ADC_CTL1(adc_periph) |= (uint32_t)ADC_CTL1_SWICST;
        }
    }
}

/*!
    \brief      configure end of conversion mode
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  end_selection: end of conversion mode
                only one parameter can be selected which is shown as below:
      \arg        ADC_EOC_SET_SEQUENCE: only at the end of a sequence of routine conversions, the EOC bit is set. Overflow detection is disabled unless DMA=1.
      \arg        ADC_EOC_SET_CONVERSION: at the end of each routine conversion, the EOC bit is set. Overflow is detected automatically.
    \param[out] none
    \retval     none
*/
void adc_end_of_conversion_config(uint32_t adc_periph, uint32_t end_selection)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_PERIPH(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x001AU), ERR_PERIPH);
    } else if(NOT_ADC_END_OF_CONVERSION_MODE(end_selection)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x001AU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_EOC_SET_SEQUENCE == end_selection) {
            /* only at the end of a sequence of routine conversions, the EOC bit is set */
            ADC_CTL1(adc_periph) &= ~((uint32_t)ADC_CTL1_EOCM);
        } else if(ADC_EOC_SET_CONVERSION == end_selection) {
            /* at the end of each routine conversion, the EOC bit is set. Overflow is detected automatically */
            ADC_CTL1(adc_periph) |= (uint32_t)ADC_CTL1_EOCM;
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      read ADC routine data register
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  none
    \param[out] none
    \retval     the conversion value
*/
uint32_t adc_routine_data_read(uint32_t adc_periph)
{
    uint32_t rdata;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_PERIPH(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x001BU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        rdata = (ADC_RDATA(adc_periph));
    }
    return (uint32_t)rdata;
}

/*!
    \brief      read ADC inserted sequence data register
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  inserted_channel : insert channel select
                only one parameter can be selected which is shown as below:
      \arg        ADC_INSERTED_CHANNEL_0: inserted Channel0
      \arg        ADC_INSERTED_CHANNEL_1: inserted channel1
      \arg        ADC_INSERTED_CHANNEL_2: inserted Channel2
      \arg        ADC_INSERTED_CHANNEL_3: inserted Channel3
    \param[out] none
    \retval     the conversion value
*/
uint32_t adc_inserted_data_read(uint32_t adc_periph, uint8_t inserted_channel)
{
    uint32_t idata;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_PERIPH(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x001CU), ERR_PERIPH);
    } else if(NOT_INSERTED_CHANNEL(inserted_channel)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x001CU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* read the data of the selected channel */
        switch(inserted_channel) {
            case ADC_INSERTED_CHANNEL_0:
                /* read the data of channel 0 */
                idata = ADC_IDATA0(adc_periph);
                break;
            case ADC_INSERTED_CHANNEL_1:
                /* read the data of channel 1 */
                idata = ADC_IDATA1(adc_periph);
                break;
            case ADC_INSERTED_CHANNEL_2:
                /* read the data of channel 2 */
                idata = ADC_IDATA2(adc_periph);
                break;
            case ADC_INSERTED_CHANNEL_3:
                /* read the data of channel 3 */
                idata = ADC_IDATA3(adc_periph);
                break;
            default:
                idata = 0U;
                break;
        }
    }
    return (uint32_t)idata;
}

/*!
    \brief      configure ADC analog watchdog 0 single channel
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  adc_channel: the selected ADC channel
                only one parameter can be selected which is shown as below:
      \arg        ADC_CHANNEL_x: ADC Channelx(x=0..20)
    \param[out] none
    \retval     none
*/
void adc_watchdog0_single_channel_enable(uint32_t adc_periph, uint8_t adc_channel)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_PERIPH(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x001DU), ERR_PERIPH);
    } else if(NOT_ADC_CHANNEL(adc_channel)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x001DU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_CTL0(adc_periph) &= ~((uint32_t)(ADC_CTL0_RWD0EN | ADC_CTL0_IWD0EN | ADC_CTL0_WD0SC |
                                             ADC_CTL0_WD0CHSEL));

        ADC_CTL0(adc_periph) |= (uint32_t)adc_channel;
        ADC_CTL0(adc_periph) |= (uint32_t)(ADC_CTL0_RWD0EN | ADC_CTL0_IWD0EN | ADC_CTL0_WD0SC);
    }
}

/*!
    \brief      configure ADC analog watchdog 0 group channel
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  adc_sequence: the sequence use analog watchdog 0
                only one parameter can be selected which is shown as below:
      \arg        ADC_ROUTINE_CHANNEL: routine sequence
      \arg        ADC_INSERTED_CHANNEL: inserted sequence
      \arg        ADC_ROUTINE_INSERTED_CHANNEL: both routine and inserted sequence
    \param[out] none
    \retval     none
*/
void adc_watchdog0_group_channel_enable(uint32_t adc_periph, uint8_t adc_sequence)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_PERIPH(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x001EU), ERR_PERIPH);
    } else if(NOT_ADC_SEQUENC_BOTH(adc_sequence)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x001EU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_CTL0(adc_periph) &= ~((uint32_t)(ADC_CTL0_RWD0EN | ADC_CTL0_IWD0EN | ADC_CTL0_WD0SC));
        /* select the sequence */
        switch(adc_sequence) {
            case ADC_ROUTINE_CHANNEL:
                ADC_CTL0(adc_periph) |= (uint32_t)ADC_CTL0_RWD0EN;
                break;
            case ADC_INSERTED_CHANNEL:
                ADC_CTL0(adc_periph) |= (uint32_t)ADC_CTL0_IWD0EN;
                break;
            case ADC_ROUTINE_INSERTED_CHANNEL:
                ADC_CTL0(adc_periph) |= (uint32_t)(ADC_CTL0_RWD0EN | ADC_CTL0_IWD0EN);
                break;
            default:
                break;
        }
    }
}

/*!
    \brief      disable ADC analog watchdog 0
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[out] none
    \retval     none
*/
void adc_watchdog0_disable(uint32_t adc_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_PERIPH(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x001FU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_CTL0(adc_periph) &= ~((uint32_t)(ADC_CTL0_RWD0EN | ADC_CTL0_IWD0EN | ADC_CTL0_WD0SC |
                                             ADC_CTL0_WD0CHSEL));
    }
}

/*!
    \brief      configure ADC analog watchdog 1 channel
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  selection_channel: the channel use analog watchdog 1
                one or more parameters can be selected which is shown as below:
      \arg        ADC_AWD1_2_SELECTION_CHANNEL_x, ADC_AWD1_2_SELECTION_CHANNEL_ALL: ADC channel analog watchdog 1/2 selection
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void adc_watchdog1_channel_config(uint32_t adc_periph, uint32_t selection_channel, ControlStatus newvalue)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_PERIPH(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0020U), ERR_PERIPH);
    } else if(NOT_ADC_ANALOG_WATCHDOG_SEL(selection_channel)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0020U), ERR_PARAM_INVALID);
    } else if(NOT_ADC_ENABLE_DISABLE(newvalue)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0020U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ENABLE == newvalue) {
            ADC_WD1SR(adc_periph) |= (uint32_t)selection_channel;
        } else {
            ADC_WD1SR(adc_periph) &= ~((uint32_t)selection_channel);
        }
    }
}

/*!
    \brief      configure ADC analog watchdog 2 channel
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  selection_channel: the channel use analog watchdog 2
                one or more parameters can be selected which is shown as below:
      \arg        ADC_AWD1_2_SELECTION_CHANNEL_x, ADC_AWD1_2_SELECTION_CHANNEL_ALL: ADC channel analog watchdog 1/2 selection
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void adc_watchdog2_channel_config(uint32_t adc_periph, uint32_t selection_channel, ControlStatus newvalue)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_PERIPH(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0021U), ERR_PERIPH);
    } else if(NOT_ADC_ANALOG_WATCHDOG_SEL(selection_channel)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0021U), ERR_PARAM_INVALID);
    } else if(NOT_ADC_ENABLE_DISABLE(newvalue)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0021U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ENABLE == newvalue) {
            ADC_WD2SR(adc_periph) |= (uint32_t)selection_channel;
        } else {
            ADC_WD2SR(adc_periph) &= ~((uint32_t)selection_channel);
        }
    }
}

/*!
    \brief      disable ADC analog watchdog 1
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[out] none
    \retval     none
*/
void adc_watchdog1_disable(uint32_t adc_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_PERIPH(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0022U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_WD1SR(adc_periph) &= ~((uint32_t)ADC_WD1SR_AWD1CS);
    }
}

/*!
    \brief      disable ADC analog watchdog 2
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[out] none
    \retval     none
*/
void adc_watchdog2_disable(uint32_t adc_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_PERIPH(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0023U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_WD2SR(adc_periph) &= ~((uint32_t)ADC_WD2SR_AWD2CS);
    }
}

/*!
    \brief      configure ADC analog watchdog 0 threshold
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  low_threshold: analog watchdog 0 low threshold, 0..0xFFFFFF for ADC0/ADC1, 0..0xFFF for ADC2
    \param[in]  high_threshold: analog watchdog 0 high threshold, 0..0xFFFFFF for ADC0/ADC1, 0..0xFFF for ADC2
    \param[out] none
    \retval     none
*/
void adc_watchdog0_threshold_config(uint32_t adc_periph, uint32_t low_threshold, uint32_t high_threshold)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_PERIPH(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0024U), ERR_PERIPH);
    } else if(NOT_ADC_ANALOG_WATCHDOG_THRESHOLD(low_threshold)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0024U), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_ADC_ANALOG_WATCHDOG_THRESHOLD(high_threshold)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0024U), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_WDLT0(adc_periph) = (uint32_t)WDLT0_WDLT0(low_threshold);
        ADC_WDHT0(adc_periph) = (uint32_t)WDHT0_WDHT0(high_threshold);
    }
}

/*!
    \brief      configure ADC analog watchdog 1 threshold
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  low_threshold: analog watchdog 1 low threshold, 0..0xFFFFFF for ADC0/ADC1, 0..0xFF for ADC2
    \param[in]  high_threshold: analog watchdog 1 high threshold, 0..0xFFFFFF for ADC0/ADC1, 0..0xFF for ADC2
    \param[out] none
    \retval     none
*/
void adc_watchdog1_threshold_config(uint32_t adc_periph, uint32_t low_threshold, uint32_t high_threshold)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_PERIPH(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0025U), ERR_PERIPH);
    } else if(NOT_ADC_ANALOG_WATCHDOG_THRESHOLD(low_threshold)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0025U), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_ADC_ANALOG_WATCHDOG_THRESHOLD(high_threshold)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0025U), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_WDLT1(adc_periph) = (uint32_t)WDLT1_WDLT1(low_threshold);
        ADC_WDHT1(adc_periph) = (uint32_t)WDHT1_WDHT1(high_threshold);
    }
}

/*!
    \brief      configure ADC analog watchdog 2 threshold
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  low_threshold: analog watchdog 2 low threshold, 0..0xFFFFFF for ADC0/ADC1, 0..0xFF for ADC2
    \param[in]  high_threshold: analog watchdog 2 high threshold, 0..0xFFFFFF for ADC0/ADC1, 0..0xFF for ADC2
    \param[out] none
    \retval     none
*/
void adc_watchdog2_threshold_config(uint32_t adc_periph, uint32_t low_threshold, uint32_t high_threshold)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_PERIPH(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0026U), ERR_PERIPH);
    } else if(NOT_ADC_ANALOG_WATCHDOG_THRESHOLD(low_threshold)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0026U), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_ADC_ANALOG_WATCHDOG_THRESHOLD(high_threshold)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0026U), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_WDLT2(adc_periph) = (uint32_t)WDLT2_WDLT2(low_threshold);
        ADC_WDHT2(adc_periph) = (uint32_t)WDHT2_WDHT2(high_threshold);
    }
}

