RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_adc.c
/*!
    \brief      configure ADC oversample mode
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  mode: ADC oversampling mode
                only one parameter can be selected which is shown as below:
      \arg        ADC_OVERSAMPLING_ALL_CONVERT: all oversampled conversions for a channel are done consecutively after a trigger
      \arg        ADC_OVERSAMPLING_ONE_CONVERT: each oversampled conversion for a channel needs a trigger
    \param[in]  shift: ADC oversampling shift
                only one parameter can be selected which is shown as below:
      \arg        ADC_OVERSAMPLING_SHIFT_NONE: no oversampling shift
      \arg        ADC_OVERSAMPLING_SHIFT_1B: 1-bit oversampling shift
      \arg        ADC_OVERSAMPLING_SHIFT_2B: 2-bit oversampling shift
      \arg        ADC_OVERSAMPLING_SHIFT_3B: 3-bit oversampling shift
      \arg        ADC_OVERSAMPLING_SHIFT_4B: 4-bit oversampling shift
      \arg        ADC_OVERSAMPLING_SHIFT_5B: 5-bit oversampling shift
      \arg        ADC_OVERSAMPLING_SHIFT_6B: 6-bit oversampling shift
      \arg        ADC_OVERSAMPLING_SHIFT_7B: 7-bit oversampling shift
      \arg        ADC_OVERSAMPLING_SHIFT_8B: 8-bit oversampling shift
      \arg        ADC_OVERSAMPLING_SHIFT_9B: 9-bit oversampling shift, available for ADC0/ADC1
      \arg        ADC_OVERSAMPLING_SHIFT_10B: 10-bit oversampling shift, available for ADC0/ADC1
      \arg        ADC_OVERSAMPLING_SHIFT_11B: 11-bit oversampling shift, available for ADC0/ADC1
    \param[in]  ratio: ADC oversampling ratio, 0..1023 for ADC0/ADC1, 0..255 for ADC2
    \param[out] none
    \retval     none
*/
void adc_oversample_mode_config(uint32_t adc_periph, uint32_t mode, uint16_t shift, uint16_t ratio)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_PERIPH(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0027U), ERR_PERIPH);
    } else if(NOT_ADC_OVERSAMPLING_MODE(mode)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0027U), ERR_PARAM_INVALID);
    } else if(NOT_ADC_OVERSAMPLING_SHIFT(shift)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0027U), ERR_PARAM_INVALID);
    } else if(NOT_ADC_OVERSAMPLING_RATIO(ratio)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0027U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_OVERSAMPLING_ALL_CONVERT == mode) {
            /* all oversampled conversions for a channel are done consecutively after a trigger */
            ADC_OVSAMPCTL(adc_periph) &= ~((uint32_t)ADC_OVSAMPCTL_TOVS);
        } else if(ADC_OVERSAMPLING_ONE_CONVERT == mode) {
            /* each oversampled conversion for a channel needs a trigger */
            ADC_OVSAMPCTL(adc_periph) |= (uint32_t)ADC_OVSAMPCTL_TOVS;
        } else {
            /* illegal parameters */
        }
        /* config the shift and ratio */
        ADC_OVSAMPCTL(adc_periph) &= ~((uint32_t)(ADC_OVSAMPCTL_OVSR | ADC_OVSAMPCTL_OVSS));
        ADC_OVSAMPCTL(adc_periph) |= ((uint32_t)shift | (uint32_t)OVSCR_OVSR(ratio));
    }
}

/*!
    \brief      enable ADC oversample mode
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[out] none
    \retval     none
*/
void adc_oversample_mode_enable(uint32_t adc_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_PERIPH(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0028U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_OVSAMPCTL(adc_periph) |= (uint32_t)ADC_OVSAMPCTL_OVSEN;
    }
}

/*!
    \brief      disable ADC oversample mode
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[out] none
    \retval     none
*/
void adc_oversample_mode_disable(uint32_t adc_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_PERIPH(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0029U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_OVSAMPCTL(adc_periph) &= ~((uint32_t)ADC_OVSAMPCTL_OVSEN);
    }
}

/*!
    \brief      get the ADC flag bits
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  flag: the adc flag
                only one parameter can be selected which is shown as below:
      \arg        ADC_FLAG_WDE0: analog watchdog 0 event flag
      \arg        ADC_FLAG_EOC: end of sequence conversion flag
      \arg        ADC_FLAG_EOIC: end of inserted sequence conversion flag
      \arg        ADC_FLAG_STIC: start flag of inserted sequence
      \arg        ADC_FLAG_STRC: start flag of routine sequence
      \arg        ADC_FLAG_ROVF: routine data register overflow flag
      \arg        ADC_FLAG_WDE1: analog watchdog 1 event flag
      \arg        ADC_FLAG_WDE2: analog watchdog 2 event flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus adc_flag_get(uint32_t adc_periph, uint32_t flag)
{
    FlagStatus reval = RESET;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_PERIPH(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002AU), ERR_PERIPH);
    } else if(NOT_ADC_FLAG(flag)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002AU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ADC_STAT(adc_periph) & flag) {
            reval = SET;
        }
    }
    return reval;
}

/*!
    \brief      clear the ADC flag bits
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  flag: the adc flag
                only one parameter can be selected which is shown as below:
      \arg        ADC_FLAG_WDE0: analog watchdog 0 event flag
      \arg        ADC_FLAG_EOC: end of sequence conversion flag
      \arg        ADC_FLAG_EOIC: end of inserted sequence conversion flag
      \arg        ADC_FLAG_STIC: start flag of inserted sequence
      \arg        ADC_FLAG_STRC: start flag of routine sequence
      \arg        ADC_FLAG_ROVF: routine data register overflow flag
      \arg        ADC_FLAG_WDE1: analog watchdog 1 event flag
      \arg        ADC_FLAG_WDE2: analog watchdog 2 event flag
    \param[out] none
    \retval     none
*/
void adc_flag_clear(uint32_t adc_periph, uint32_t flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_PERIPH(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002BU), ERR_PERIPH);
    } else if(NOT_ADC_FLAG(flag)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002BU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_STAT(adc_periph) = ~((uint32_t)flag);
    }
}

/*!
    \brief      enable ADC interrupt
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  adc_interrupt: the adc interrupt
                only one parameter can be selected which is shown as below:
      \arg        ADC_INT_WDE0: analog watchdog 0 interrupt
      \arg        ADC_INT_EOC: end of sequence conversion interrupt
      \arg        ADC_INT_EOIC: end of inserted sequence conversion interrupt
      \arg        ADC_INT_ROVF: routine data register overflow interrupt
      \arg        ADC_INT_WDE1: analog watchdog 1 interrupt
      \arg        ADC_INT_WDE2: analog watchdog 2 interrupt
    \param[out] none
    \retval     none
*/
void adc_interrupt_enable(uint32_t adc_periph, uint32_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_PERIPH(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002CU), ERR_PERIPH);
    } else if(NOT_ADC_INTERRUPT(interrupt)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002CU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_CTL0(adc_periph) |= (uint32_t)interrupt;
    }
}

/*!
    \brief      disable ADC interrupt
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  adc_interrupt: the adc interrupt
                only one parameter can be selected which is shown as below:
      \arg        ADC_INT_WDE0: analog watchdog 0 interrupt
      \arg        ADC_INT_EOC: end of sequence conversion interrupt
      \arg        ADC_INT_EOIC: end of inserted sequence conversion interrupt
      \arg        ADC_INT_ROVF: routine data register overflow interrupt
      \arg        ADC_INT_WDE1: analog watchdog 1 interrupt
      \arg        ADC_INT_WDE2: analog watchdog 2 interrupt
    \param[out] none
    \retval     none
*/
void adc_interrupt_disable(uint32_t adc_periph, uint32_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_PERIPH(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002DU), ERR_PERIPH);
    } else if(NOT_ADC_INTERRUPT(interrupt)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002DU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_CTL0(adc_periph) &= ~(uint32_t)interrupt;
    }
}

/*!
    \brief      get the ADC interrupt bits
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  int_flag: the adc interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        ADC_INT_FLAG_WDE0: analog watchdog 0 interrupt
      \arg        ADC_INT_FLAG_EOC: end of sequence conversion interrupt
      \arg        ADC_INT_FLAG_EOIC: end of inserted sequence conversion interrupt
      \arg        ADC_INT_FLAG_ROVF: routine data register overflow interrupt
      \arg        ADC_INT_FLAG_WDE1: analog watchdog 1 interrupt
      \arg        ADC_INT_FLAG_WDE2: analog watchdog 2 interrupt
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus adc_interrupt_flag_get(uint32_t adc_periph, uint32_t int_flag)
{
    FlagStatus reval = RESET;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_PERIPH(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002EU), ERR_PERIPH);
    } else if(NOT_ADC_INTERRUPT_FLAG(flag)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002EU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t state;
        /* check the interrupt bits */
        switch(int_flag) {
            case ADC_INT_FLAG_WDE0:
                /* get the ADC analog watchdog 0 interrupt bits */
                state = ADC_STAT(adc_periph) & ADC_STAT_WDE0;
                if((ADC_CTL0(adc_periph) & ADC_CTL0_WDE0IE) && state) {
                    reval = SET;
                }
                break;
            case ADC_INT_FLAG_EOC:
                /* get the ADC end of sequence conversion interrupt bits */
                state = ADC_STAT(adc_periph) & ADC_STAT_EOC;
                if((ADC_CTL0(adc_periph) & ADC_CTL0_EOCIE) && state) {
                    reval = SET;
                }
                break;
            case ADC_INT_FLAG_EOIC:
                /* get the ADC end of inserted sequence conversion interrupt bits */
                state = ADC_STAT(adc_periph) & ADC_STAT_EOIC;
                if((ADC_CTL0(adc_periph) & ADC_CTL0_EOICIE) && state) {
                    reval = SET;
                }
                break;
            case ADC_INT_FLAG_ROVF:
                /* get the ADC routine data register overflow interrupt bits */
                state = ADC_STAT(adc_periph) & ADC_STAT_ROVF;
                if((ADC_CTL0(adc_periph) & ADC_CTL0_ROVFIE) && state) {
                    reval = SET;
                }
                break;
            case ADC_INT_FLAG_WDE1:
                /* get the ADC analog watchdog 1 interrupt bits */
                state = ADC_STAT(adc_periph) & ADC_STAT_WDE1;
                if((ADC_CTL0(adc_periph) & ADC_CTL0_WDE1IE) && state) {
                    reval = SET;
                }
                break;
            case ADC_INT_FLAG_WDE2:
                /* get the ADC analog watchdog 2 interrupt bits */
                state = ADC_STAT(adc_periph) & ADC_STAT_WDE2;
                if((ADC_CTL0(adc_periph) & ADC_CTL0_WDE2IE) && state) {
                    reval = SET;
                }
                break;
            default:
                break;
        }
    }
    return reval;
}

/*!
    \brief      clear the ADC flag
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  int_flag: the adc interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        ADC_INT_FLAG_WDE0: analog watchdog 0 interrupt flag
      \arg        ADC_INT_FLAG_EOC: end of sequence conversion interrupt flag
      \arg        ADC_INT_FLAG_EOIC: end of inserted sequence conversion interrupt flag
      \arg        ADC_INT_FLAG_ROVF: routine data register overflow interrupt flag
      \arg        ADC_INT_FLAG_WDE1: analog watchdog 1 interrupt flag
      \arg        ADC_INT_FLAG_WDE2: analog watchdog 2 interrupt flag
    \param[out] none
    \retval     none
*/
void adc_interrupt_flag_clear(uint32_t adc_periph, uint32_t int_flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_PERIPH(adc_periph)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002FU), ERR_PERIPH);
    } else if(NOT_ADC_INTERRUPT_FLAG(flag)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x002FU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_STAT(adc_periph) = ~((uint32_t)int_flag);
    }
}

/*!
    \brief      configure the ADC sync mode
    \param[in]  sync_mode: ADC sync mode
                only one parameter can be selected which is shown as below:
      \arg        ADC_SYNC_MODE_INDEPENDENT: all the ADCs work independently
      \arg        ADC_DAUL_ROUTINE_PARALLEL_INSERTED_PARALLEL: combined routine parallel & inserted parallel mode
      \arg        ADC_DAUL_ROUTINE_PARALLEL_INSERTED_ROTATION: combined routine parallel & trigger rotation mode
      \arg        ADC_DAUL_INSERTED_PARALLEL: inserted parallel mode
      \arg        ADC_DAUL_ROUTINE_PARALLEL: routine parallel mode
      \arg        ADC_DAUL_ROUTINE_FOLLOW_UP: follow-up mode
      \arg        ADC_DAUL_INSERTED_TRIGGER_ROTATION: trigger rotation mode
    \param[out] none
    \retval     none
*/
void adc_sync_mode_config(uint32_t sync_mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_SYNC_mode(sync_mode)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0030U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_SYNCCTL(ADC0) &= ~((uint32_t)ADC_SYNCCTL_SYNCM);
        ADC_SYNCCTL(ADC0) |= (uint32_t)sync_mode;
    }
}

/*!
    \brief      configure the delay between 2 sampling phases in ADC sync modes
    \param[in]  sample_delay:  the delay between 2 sampling phases in ADC sync modes
                only one parameter can be selected which is shown as below:
      \arg        ADC_SYNC_DELAY_xCYCLE: x=5..20,the delay between 2 sampling phases in ADC sync modes is x ADC clock cycles
    \param[out] none
    \retval     none
*/
void adc_sync_delay_config(uint32_t sample_delay)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_SYNC_DELAY_SAMPLE(sample_delay)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0031U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_SYNCCTL(ADC0) &= ~((uint32_t)ADC_SYNCCTL_SYNCDLY);
        ADC_SYNCCTL(ADC0) |= (uint32_t)sample_delay;
    }
}

/*!
    \brief      configure ADC sync DMA mode selection
    \param[in]  dma_mode:  ADC sync DMA mode
                only one parameter can be selected which is shown as below:
      \arg        ADC_SYNC_DMA_DISABLE: ADC sync DMA disabled
      \arg        ADC_SYNC_DMA_MODE0: ADC sync DMA mode 0
      \arg        ADC_SYNC_DMA_MODE1: ADC sync DMA mode 1
    \param[out] none
    \retval     none
*/
void adc_sync_dma_config(uint32_t dma_mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ADC_SYNC_DMA_mode(dma_mode)) {
        fw_debug_report_err(ADC_MODULE_ID, API_ID(0x0032U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ADC_SYNCCTL(ADC0) &= ~((uint32_t)ADC_SYNCCTL_SYNCDMA);
        ADC_SYNCCTL(ADC0) |= (uint32_t)dma_mode;
    }
}

/*!
    \brief      configure ADC sync DMA engine issues requests according to the SYNCDMA bits
    \param[in]  none
    \param[out] none
    \retval     none
*/
void adc_sync_dma_request_after_last_enable(void)
{
    ADC_SYNCCTL(ADC0) |= (uint32_t)ADC_SYNCCTL_SYNCDDM;
}

/*!
    \brief      configure ADC sync DMA engine is disabled after the end of transfer signal from DMA controller is detected
    \param[in]  none
    \param[out] none
    \retval     none
*/
void adc_sync_dma_request_after_last_disable(void)
{
    ADC_SYNCCTL(ADC0) &= ~((uint32_t)ADC_SYNCCTL_SYNCDDM);
}

/*!
    \brief      read ADC sync master adc routine data register 0
    \param[in]  none
    \param[out] none
    \retval     sync routine data 0
*/
uint32_t adc_sync_master_adc_routine_data0_read(void)
{
    return (uint32_t)(ADC_SYNCDATA0 & ADC_SYNCDATA0_SYNCDATA0);
}

/*!
    \brief      read ADC sync slave adc routine data register 0
    \param[in]  none
    \param[out] none
    \retval     sync routine data 0
*/
uint32_t adc_sync_slave_adc_routine_data0_read(void)
{
    return (uint32_t)(ADC_SYNCDATA0 & ADC_SYNCDATA0_SYNCDATA1) >> 16;
}

/*!
    \brief      read ADC sync routine data register 1
    \param[in]  none
    \param[out] none
    \retval     sync routine data 1
*/
uint32_t adc_sync_routine_data1_read(void)
{
    return (uint32_t)ADC_SYNCDATA1;
}
